tap "homebrew/bundle"
tap "homebrew/services"

brew "bat"
brew "bottom"
brew "curl"
brew "gdu"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "hivemind"
brew "lazydocker"
brew "lazygit"
brew "libyaml"
brew "lsd"
brew "mas"
brew "mise"
brew "neovim"
brew "postgresql@17", restart_service: true
brew "readline"
brew "ripgrep"
brew "starship"
brew "trash"
brew "wget"
brew "zellij"
brew "zoxide"
brew "zplug"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "alfred"
cask "appcleaner"
cask "chromium"
cask "docker"
cask "firefox"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "kitty"
cask "linearmouse"
cask "logi-options+"
cask "logitech-g-hub"
cask "obs"
cask "obsidian"
cask "openvpn-connect"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vivaldi"
cask "whatsapp"

mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Unsplash Wallpapers", id: 1284863847
mas "WireGuard", id: 1451685025
mas "iMovie", id: 408981434

vscode "4ops.packer"
vscode "ban.spellright"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "koichisasada.vscode-rdbg"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-repositories"
vscode "shopify.ruby-lsp"
vscode "tyriar.sort-lines"
vscode "vscodevim.vim"
vscode "willasm.comment-highlighter"
